Revit 2024 API
StructuralSectionsServiceData Class
 The data needed by section type server to perform type definition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class StructuralSectionsServiceData : IDisposable
Visual Basic
Public Class StructuralSectionsServiceData _
	Implements IDisposable
Visual C++
public ref class StructuralSectionsServiceData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSectionsServiceData
See Also
StructuralSectionsServiceData Members
Autodesk.Revit.DB.Structure Namespace